Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SMTPСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортPOP3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяSMTPАутентификация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьКопииСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьПисьмаССервераЧерез</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейУдаленияПисемССервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВходящие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсходящие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаУдаленные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЧерновики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНежелательные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТекстаПисьмаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьПодписьКИсходящимПисьмам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьПодписьКОтветамИПересылкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоПолучениеОтправкаСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтоПолученияОтправкиСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаАвтоПолучениеОтправкуСообщений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещатьОтветыИПереадресацииВТужеГруппу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеАвтополученияОтправкиСообщений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтоматическойУстановкиОтметкиРассмотрено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотреноПриОтвете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотреноПриПолученииОтвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКлассификациюПисемПоПредметам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьПустойПредметДляНовыхПисемИзТемыПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьПредмет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьОснованиеНовогоПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьГруппуПисемНовогоПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтосохранениеПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтосохраненияПисем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматПисьмаДляОтветовИПереадресацийБратьИзИсходного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкаПисемПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкуПисьмаДляОтветовБратьИзИсходного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбъектыИзАдресовПервогоПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеУчетнойЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияУчетнойЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSLPOP3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSLSMTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаЧерезСерверItStuff</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступКУчетнойЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Администрирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НазначенияУчетнойЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>НазначенияУчетнойЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерепискаСКандидатами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеИОтправка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УчетныеЗаписиЭлектроннойПочты/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ЗаполнитьСписокКодировок()

	мСписокКодировок = УправлениеЭлектроннойПочтой.ПолучитьСписокКодировок();
	мМассивКодировок = мСписокКодировок.ВыгрузитьЗначения();
	Элементы.КодировкаПисемПоУмолчанию.СписокВыбора.ЗагрузитьЗначения(мМассивКодировок);

КонецПроцедуры

// Процедура управляет доступностью элементов управления, связанных с механизмом настройки получения/удаления писем с сервера
//
Процедура ДоступностьНастройкиПолученияПисемССервера()

	Элементы.УдалятьПисьмаССервераЧерез.Доступность				= Объект.ОставлятьКопииСообщенийНаСервере;
	Элементы.КоличествоДнейУдаленияПисемССервера.Доступность	= Объект.УдалятьПисьмаССервераЧерез;
	Элементы.ДекорацияУдалятьПисьма.Доступность					= Объект.УдалятьПисьмаССервераЧерез;

КонецПроцедуры

// Процедура управляет доступностью страниц панели.
//
Процедура ДоступностьСтраниц()

	Элементы.ГруппаГруппыПисем.Доступность		= НЕ Объект.Ссылка.Пустая();
	Элементы.ГруппаДополнительно.Доступность	= НЕ Объект.Ссылка.Пустая();
	Элементы.ГруппаФильтры.Доступность			= НЕ Объект.Ссылка.Пустая();

КонецПроцедуры

// Процедура управляет доступностью элементов управления, связанных с механизмом классификации писем по предметам
//
Процедура ДоступностьПредметовПисем()
	
	Элементы.ЗаполнятьПустойПредметДляНовыхПисемИзТемыПисьма.Доступность										= Объект.ИспользоватьКлассификациюПисемПоПредметам;
	Элементы.ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьПредмет.Доступность					= Объект.ИспользоватьКлассификациюПисемПоПредметам;
	Элементы.ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьОснованиеНовогоПисьма.Доступность	= Объект.ИспользоватьКлассификациюПисемПоПредметам;
	Элементы.ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьГруппуПисемНовогоПисьма.Доступность	= Объект.ИспользоватьКлассификациюПисемПоПредметам;
	
КонецПроцедуры

// Процедура управляет доступностью элементов управления, связанных с механизмом автосохранения писем
//
Процедура ДоступностьАвтосохраненияПисем()

	Элементы._ИнтервалАвтосохраненияПисем.Доступность	= Объект.АвтосохранениеПисем;
	Элементы.ИнтервалАвтосохраненияПисем_.Доступность	= Объект.АвтосохранениеПисем;
	Элементы.ИнтервалАвтосохраненияПисем.Доступность	= Объект.АвтосохранениеПисем;

КонецПроцедуры

// Процедура управляет доступностью элементов управления, связанных с механизмом настройкой подписи электронных писем
//
Процедура ДоступностьФлажковИспользованияПодписи()
	
	Элементы.ДобавлятьПодписьКОтветамИПересылкам.Доступность = Объект.ДобавлятьПодписьКИсходящимПисьмам;
	
КонецПроцедуры

// Процедура управляет доступностью элементов управления, связанных с
// механизмом атентификации при доступе к SMTP серверу электронной почты
//
Процедура ДоступностьSMTPАутентификации()

	Элементы.ПарольSMTP.Доступность	= Объект.ТребуетсяSMTPАутентификация;
	Элементы.ЛогинSMTP.Доступность	= Объект.ТребуетсяSMTPАутентификация;

КонецПроцедуры

// Процедура управляет доступностью элементов управления, связанных с механизмом автополучения/отправки писем
//
Процедура ДоступностьПараметровАвтополучения()

	Элементы._ИнтервалАвтоПолученияОтправкиСообщений.Доступность		= Объект.АвтоПолучениеОтправкаСообщений;
	Элементы.ИнтервалАвтоПолученияОтправкиСообщений.Доступность			= Объект.АвтоПолучениеОтправкаСообщений;
	Элементы.ИнтервалАвтоПолученияОтправкиСообщений_.Доступность		= Объект.АвтоПолучениеОтправкаСообщений;
	Элементы._ОтветственныйЗаАвтоПолучениеОтправкуСообщений.Доступность	= Объект.АвтоПолучениеОтправкаСообщений;
	Элементы.ОтветственныйЗаАвтоПолучениеОтправкуСообщений.Доступность	= Объект.АвтоПолучениеОтправкаСообщений;
	Элементы._ДействиеАвтополученияОтправкиСообщений.Доступность		= Объект.АвтоПолучениеОтправкаСообщений;
	Элементы.ДействиеАвтополученияОтправкиСообщений.Доступность			= Объект.АвтоПолучениеОтправкаСообщений;

КонецПроцедуры

// Процедура управляет доступностью элементов управления, связанных с
// механизмом автоустановки рассмотренности писем электронной почты
//
Процедура ДоступностьИнтервалаАвтопометкиРассмотрено()

	Элементы.ИнтервалАвтоматическойУстановкиОтметкиРассмотрено.Доступность	= Объект.АвтоматическаяУстановкаПометкиРассмотрено;
	Элементы.ИнтервалАвтоматическойУстановкиОтметкиРассмотрено_.Доступность	= Объект.АвтоматическаяУстановкаПометкиРассмотрено;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Сформируем список выбора возможных видов текстов электронных писем
	Элементы.ФорматТекстаПисьмаПоУмолчанию.СписокВыбора.Добавить(Перечисления.ВидыТекстовЭлектронныхПисем.HTML);
	Элементы.ФорматТекстаПисьмаПоУмолчанию.СписокВыбора.Добавить(Перечисления.ВидыТекстовЭлектронныхПисем.Текст);

	Если Объект.Ссылка.Пустая() Тогда // Это новый
		
		Объект.ПортSMTP = 25;
		Объект.ПортPOP3 = 110;
		Объект.ВремяОжиданияСервера 			= 60;
		Объект.ФорматТекстаПисьмаПоУмолчанию 	= Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
		Объект.ИнтервалАвтоматическойУстановкиОтметкиРассмотрено 	= 5;
		Объект.ИнтервалАвтосохраненияПисем 							= 30;
		
		СтрокиДоступа =
			Объект.ДоступКУчетнойЗаписи.НайтиСтроки(Новый Структура("Пользователь", глЗначениеПеременной("глТекущийПользователь")));
		Если СтрокиДоступа.Количество() > 0 Тогда
			СтрокаДоступа = Объект.ДоступКУчетнойЗаписи.Добавить();
			СтрокаДоступа.Пользователь		= глЗначениеПеременной("глТекущийПользователь");
			СтрокаДоступа.Администрирование = Истина;
			СтрокаДоступа.Запись 			= Истина;
		КонецЕсли;
			
		Объект.НазначениеУчетнойЗаписи = Перечисления.НазначенияУчетнойЗаписи.ПерепискаСКандидатами;
		
	КонецЕсли;
	
	ДоступностьНастройкиПолученияПисемССервера();
	ДоступностьСтраниц();
	ДоступностьПредметовПисем();
	ДоступностьАвтосохраненияПисем();
	ДоступностьФлажковИспользованияПодписи();
	ДоступностьSMTPАутентификации();
	ДоступностьПараметровАвтополучения();
	ДоступностьИнтервалаАвтопометкиРассмотрено();
	

	ЭлементПорядка = ЭтаФорма.ГруппыПисем.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле 				= Новый ПолеКомпоновкиДанных("Порядок");
	ЭлементПорядка.Использование 		= Истина;
	ЭлементПорядка.ТипУпорядочивания 	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДоступностьФлажковИспользованияПодписи();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДоступностьСтраниц();
	
КонецПроцедуры


Процедура ПроверитьНастройкиУчетнойЗаписиСервер()
	
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	
	Проверка = СпрОбъект.ПроверитьЗаполнениеОбязательныхПолей();
	Если ЗначениеЗаполнено(Проверка) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("" + Проверка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкиУчетнойЗаписи(Команда)
	
	мПрофиль = Новый ИнтернетПочтовыйПрофиль;
	
	мПрофиль.АдресСервераPOP3 = Объект.POP3Сервер;
	мПрофиль.АдресСервераSMTP = Объект.SMTPСервер;
	Если Объект.ВремяОжиданияСервера > 0 Тогда
		мПрофиль.ВремяОжидания = Объект.ВремяОжиданияСервера;
	КонецЕсли; 
	мПрофиль.Пароль           = Объект.Пароль;
	мПрофиль.Пользователь     = Объект.Логин;
	мПрофиль.ПортPOP3         = Объект.ПортPOP3;
	мПрофиль.ПортSMTP         = Объект.ПортSMTP;
	
	Если Объект.ТребуетсяSMTPАутентификация Тогда
		мПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		мПрофиль.ПарольSMTP         = Объект.ПарольSMTP;
		мПрофиль.ПользовательSMTP   = Объект.ЛогинSMTP;
	Иначе
		мПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		мПрофиль.ПарольSMTP         = "";
		мПрофиль.ПользовательSMTP   = "";
	КонецЕсли; 
	
	ИнтернетПочта = Новый ИнтернетПочта;
	
	Попытка
		ИнтернетПочта.Подключиться(мПрофиль);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		ПроверитьНастройкиУчетнойЗаписиСервер();
		Предупреждение("Произошли ошибки при проверке настроек учетной записи.
					   |Описание ошибки приведено в окне сообщения.");
		Возврат;
	КонецПопытки;
	
	Предупреждение("Проверка подключения к почтовому серверу с заданными параметрами выполнена успешно.");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПомеченныеНаУдаление(Команда)
	
	//ОбработкаУдаления = Обработки.УдалениеПисемЭлектроннойПочты.Создать();
	//ОбработкаУдаления.УчетнаяЗапись = Ссылка;
	//ФормаПоискаДокументов = ОбработкаУдаления.ПолучитьФорму(, ЭтаФорма);
	//ФормаПоискаДокументов.Заголовок = "Удаление электронных писем, учетная запись """ + Наименование + " <" + АдресЭлектроннойПочты + ">""";
	//ФормаПоискаДокументов.Открыть();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = Объект.АдресЭлектроннойПочты;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяSMTPАутентификацияПриИзменении(Элемент)
	
	ДоступностьSMTPАутентификации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОставлятьКопииСообщенийНаСервереПриИзменении(Элемент)
	
	Объект.УдалятьПисьмаССервераЧерез = Объект.ОставлятьКопииСообщенийНаСервере;
	
	ДоступностьНастройкиПолученияПисемССервера();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьПисьмаССервераЧерезПриИзменении(Элемент)
	
	ДоступностьНастройкиПолученияПисемССервера();
	
КонецПроцедуры

Процедура УстановитьДействиеАвтополученияОтправкиСообщений()
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтветственныйЗаАвтоПолучениеОтправкуСообщений) Тогда
		Объект.ОтветственныйЗаАвтоПолучениеОтправкуСообщений = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДействиеАвтополученияОтправкиСообщений) Тогда
		Объект.ДействиеАвтополученияОтправкиСообщений = Перечисления.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем.ПолучениеИОтправка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоПолучениеОтправкаСообщенийПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ИнтервалАвтоПолученияОтправкиСообщений) Тогда
		Объект.ИнтервалАвтоПолученияОтправкиСообщений = 15;
	КонецЕсли;
	
	УстановитьДействиеАвтополученияОтправкиСообщений();
	
	ДоступностьПараметровАвтополучения();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтосохранениеПисемПриИзменении(Элемент)
	
	ДоступностьАвтосохраненияПисем();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическаяУстановкаПометкиРассмотреноПриИзменении(Элемент)
	
	ДоступностьИнтервалаАвтопометкиРассмотрено();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКлассификациюПисемПоПредметамПриИзменении(Элемент)
	
	Если НЕ Объект.ИспользоватьКлассификациюПисемПоПредметам Тогда
		Объект.ЗаполнятьПустойПредметДляНовыхПисемИзТемыПисьма											= Ложь;
		Объект.ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьПредмет					= Ложь;
		Объект.ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьОснованиеНовогоПисьма		= Ложь;
		Объект.ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьГруппуПисемНовогоПисьма	= Ложь;
	КонецЕсли;
	
	ДоступностьПредметовПисем();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьПодписьКИсходящимПисьмамПриИзменении(Элемент)
	
	Объект.ДобавлятьПодписьКОтветамИПересылкам = Объект.ДобавлятьПодписьКИсходящимПисьмам;
	ДоступностьФлажковИспользованияПодписи();
	
КонецПроцедуры


//ЗаполнитьСписокКодировок();
